In [1]:
import sqlite3
import pandas as pd

In [2]:
# Create an in-memory SQLite database
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

In [3]:
# Create employees table
cursor.execute('''
    CREATE TABLE employees (
        id INTEGER PRIMARY KEY,
        name TEXT,
        department TEXT,
        salary INTEGER
    )
''')

In [4]:
# Insert data into employees table
employees_data = [
    (1, 'Alice', 'HR', 50000),
    (2, 'Bob', 'IT', 70000),
    (3, 'Charlie', 'IT', 65000),
    (4, 'David', 'HR', 52000),
    (5, 'Eve', 'Finance', 80000)
]

cursor.executemany("INSERT INTO employees VALUES (?, ?, ?, ?)", employees_data)
conn.commit()

In [5]:
# Function to run SQL queries and display results
def run_query(query):
    df = pd.read_sql_query(query, conn)
    display(df)

In [6]:
# Task 1: Retrieve all employees who work in the IT department
print("Employees in IT department:")
run_query("SELECT * FROM employees WHERE department = 'IT'")

Employees in IT department:

   id     name department  salary
0   2      Bob         IT   70000
1   3  Charlie         IT   65000

In [7]:
# Task 2: Find the total number of employees
print("Total number of employees:")
run_query("SELECT COUNT(*) AS total_employees FROM employees")

Total number of employees:

   total_employees
0                5

In [8]:
# Task 3: Get the average salary of all employees
print("Average salary of employees:")
run_query("SELECT AVG(salary) AS average_salary FROM employees")

Average salary of employees:

   average_salary
0         63400.0

In [9]:
# Task 4: Retrieve the highest salary from the employees table
print("Highest salary among employees:")
run_query("SELECT MAX(salary) AS highest_salary FROM employees")

Highest salary among employees:

   highest_salary
0           80000

In [10]:
# Task 5: Display employee names and their salaries in descending order of salary
print("Employees sorted by salary (descending order):")
run_query("SELECT name, salary FROM employees ORDER BY salary DESC")

Employees sorted by salary (descending order):

      name  salary
0      Eve   80000
1      Bob   70000
2  Charlie   65000
3    David   52000
4    Alice   50000

In [11]:
# Close the connection
conn.close()